Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: In pass-through kitchens where counters, appliances or cabinets are on two opposing sides, or where counters, appliances or cabinets are opposite a parallel wall, clearance between all opposing base cabinets, countertops, appliances, or walls within kitchen work areas shall be 40 inches (1015 mm) minimum.
fr_ca: Dans les cuisines avec passe-plat où les comptoirs, les appareils électroménagers ou les armoires sont sur deux côtés opposés, ou lorsque les comptoirs, les appareils électroménagers ou les armoires sont en face d'un mur parallèle, le dégagement entre toutes les bases de mur, tous les comptoirs, tous les appareils électroménagers ou tous les murs opposés dans les zones de travail de la cuisine doit être d'au moins 40 po [1015 mm].

source: In private residence elevators, the inside dimensions of elevator cars shall provide a clear floor length of 48 inches (1220 mm) minimum and a clear floor width of 36 inches (760 mm) minimum.
fr_ca: Dans les ascenseurs de résidences privées, les dimensions intérieures des cabines d'ascenseur doivent offrir une longueur libre au sol d'au moins 48 po [1220 mm] et une largeur libre au sol d'au moins 36 po [760 mm].

source: In recreational facilities, lockers that are required to be accessible in accordance with Section 1110.10.
fr_ca: Dans les installations de loisirs, les casiers qui doivent être accessibles selon la section 1110.10.

source: In row seating, the companion seat shall be located to provide shoulder alignment with the wheelchair space occupant.
fr_ca: Dans les SIÈGES en rangée, le siège d'accompagnateur doit être situé de manière à permettre l'alignement des épaules avec l'occupant de l'espace pour fauteuil roulant.

source: In spaces utilized primarily for viewing motion picture projections, wheelchair space locations shall comply with Section 802.10.4.
fr_ca: Dans les espaces utilisés principalement pour regarder des projections de films, les emplacements pour fauteuils roulants doivent être conformes à la section 802.10.4.

source: In standard roll-in showers, the controls and hand shower shall not be located above the seat.
fr_ca: Dans les douches à l'italienne standard, les commandes et la douchette ne doivent pas être situées au-dessus du siège.

source: In standard roll-in type showers, a grab bar shall be provided on the back wall beginning at the edge of the seat.
fr_ca: Dans les douches à l'italienne standard, il faut prévoir une barre d'appui sur le mur arrière à partir du bord du siège.

source: In standard roll-in-type showers, the seat shall extend from the control wall to a point within 3 inches (75 mm) of the compartment entry.
fr_ca: Dans les douches à accès de plain-pied standard, le siège doit s'étendre du mur de commande jusqu'à un point situé à moins de 3 po [75 mm] de l'entrée de la cabine.

source: In structures with four or more dwelling units or sleeping units intended to be occupied as a residence, every dwelling unit and sleeping unit intended to be occupied as a residence shall be a Type B unit.
fr_ca: Dans les bâtiments comportant quatre logements ou unités de couchage ou plus destinés à être occupés comme résidence, chaque logement et chaque unité de couchage destiné à être occupé comme résidence doit être une unité de type B.

source: In structures with four or more sleeping units intended to be occupied as a residence, every sleeping unit intended to be occupied as a residence shall be a Type B unit.
fr_ca: Dans les structures comportant quatre unités de couchage ou plus destinées à être occupées comme résidence, chaque unité de couchage destinée à être occupée comme résidence doit être une unité de type B.

source: In the case of demolition, the site plan shall show construction to be demolished and the location and size of existing structures and construction that are to remain on the site or plot.
fr_ca: Dans le cas d’une démolition, le plan de situation doit indiquer les constructions à démolir ainsi que l’emplacement et les dimensions des structures et constructions existantes qui doivent rester sur le terrain ou la parcelle.

source: In the case of other side boundaries for aisles or aisle accessways, the clear width shall be measured to walls, edges of seating and tread edges.
fr_ca: Dans le cas d'autres limites latérales différentes pour les allées ou les voies d'accès aux allées, la largeur libre doit être mesurée jusqu'aux murs, aux bords des sièges et aux bords des marches.

source: In the kitchen, pantry, breakfast room, dining room, or similar area of a dwelling unit, the two or more 20-ampere small-appliance branch circuits required by Section E3703.2, shall serve all wall and floor receptacle outlets covered by Sections E3901.2 and E3901.4 and those receptacle outlets provided for refrigeration appliances.
fr_ca: Dans la cuisine, le garde-manger, la salle de petit-déjeuner, la salle à manger ou une zone similaire d'une unité d'habitation, les deux circuits de dérivation ou plus de 20 ampères pour petits appareils exigés par l'article E3703.2 doivent desservir toutes les prises murales et de plancher visées par les articles E3901.2 et E3901.4 et les prises prévues pour les appareils de réfrigération.

source: In the raised position, the side rail shall be permitted to overlap the side clearance.
fr_ca: En position relevée, la barrière latérale peut chevaucher le dégagement latéral.

source: In toilet rooms and bathrooms not required to comply with Section 1102.11.2, maneuvering clearances required by Section 404.2.3 shall not be required on the toilet room or bathroom side of the door.
fr_ca: Dans les salles de toilette et les salles de bain qui ne sont pas tenues de se conformer à la section 1102.11.2, les espaces de dégagement exigés par la section 404.2.3 ne sont pas exigés du côté de la salle de toilette ou de la salle de bain de la porte.

source: In toilet rooms and bathrooms not required to comply with Section 1103.11.2, maneuvering clearances required by Section 404.2.3 shall not be required on the toilet room or bathroom side of the door.
fr_ca: Dans les salles de toilette et les salles de bain qui ne sont pas tenues de se conformer à la section 1103.11.2, les espaces de dégagement exigés par la section 404.2.3 ne sont pas exigés du côté de la porte donnant sur la salle de toilette ou la salle de bain.

source: In transfer-type and alternate roll-in-type showers, the seat shall extend along the seat wall to a point within 3 inches (75 mm) of the compartment entry.
fr_ca: Dans les douches de type transfert et de type alternatif à accès de plain-pied, le siège doit s'étendre le long du mur du siège jusqu'à un point situé à moins de 3 po [75 mm] de l'entrée de la cabine.

source: In transfer-type shower compartments, thresholds 1/2 inch (13 mm) maximum in height shall be beveled, rounded, or vertical.
fr_ca: Dans les cabines de douche de type transfert, les seuils d'une hauteur maximale de 1/2 po (13 mm) doivent être biseautés, arrondis ou verticaux.

source: In transfer-type showers, the controls and hand shower shall be located:
fr_ca: Dans les douches de type transfert, les commandes et la douchette doivent être situées :

source: In-building, two-way emergency responder communication coverage shall be provided in accordance with Section 510 of the International Fire Code.
fr_ca: Une couverture de communication d’urgence bidirectionnelle pour les intervenants d’urgence à l’intérieur du bâtiment doit être assurée conformément à l’article 510 de l’International Fire Code.

source: Inaccessible building entrances.
fr_ca: Entrées d'immeubles inaccessibles.

source: Inaccessible public toilets and bathing facilities.
fr_ca: Toilettes publiques et salles de bain non accessibles.

source: Indicate the use and occupancy for which the proposed work is intended.
fr_ca: Indiquer l'usage et l'occupation auxquels les travaux proposés sont destinés.

source: Individual glazed areas, including glass mirrors in hazardous locations such as those indicated as defined in Section R308.4, shall pass the test requirements of Section R308.3.1.
fr_ca: Les surfaces vitrées individuelles, y compris les miroirs en verre dans les endroits dangereux tels que ceux indiqués comme définis à l'article R308.4, doivent satisfaire aux exigences d'essai de l'article R308.3.1.

source: Industrial scissor lifts
fr_ca: Élévateurs à ciseaux industriels

source: Inside handrails on switchback or dogleg stairs or ramps shall be continuous between flights or runs.
fr_ca: Les rampes intérieures sur les escaliers ou les rampes en lacets ou en coude doivent être continues entre les volées ou les tronçons.

source: Inspections presuming to give authority to violate or cancel the provisions of this code or of other ordinances of the jurisdiction shall not be valid.
fr_ca: Les inspections qui prétendent autoriser la violation ou l’annulation des dispositions du présent code ou d’autres ordonnances de la juridiction ne sont pas valides.

source: Inspections shall be made to determine compliance with Chapter 13 and shall include, but not be limited to, inspections for: envelope insulation R- and U-values, fenestration U-value, duct system R-value, and HVAC and water-heating equipment efficiency.
fr_ca: Des inspections doivent être effectuées afin de vérifier la conformité au chapitre 13 et doivent notamment porter sur les éléments suivants : les valeurs R et U de l’isolation de l’enveloppe, la valeur U des vitrages, la valeur R du système de conduits, ainsi que le rendement des équipements de CVC et de chauffage de l’eau.

source: Installation of smoke doors shall be in accordance with NFPA 105.
fr_ca: L'installation des portes pare-fumée doit être conforme à la norme NFPA 105.

source: Installation of steel fireplace units with solid masonry to form a masonry fireplace is permitted where installed either in accordance with the requirements of their listing or the requirements of this section.
fr_ca: L'installation d'unités de foyer en acier avec de la maçonnerie pleine pour former un foyer en maçonnerie est autorisée lorsqu'elles sont installées conformément aux exigences de leur homologation ou aux exigences de la présente section.

source: Installation shall be in accordance with Section 906 and the extinguisher shall be located within a 30-foot (9144 mm) distance of travel from each domestic cooking appliance.
fr_ca: L'installation doit être conforme à la section 906 et l'extincteur doit être situé à une distance de parcours de 30 pi [9144 mm] de chaque appareil de cuisson domestique.

source: Instead of an individual permit for each alteration to an already approved electrical, gas, mechanical or plumbing installation, the building official is authorized to issue an annual permit upon application therefor to any person, firm or corporation regularly employing one or more qualified tradespersons in the building, structure or on the premises owned or operated by the applicant for the permit.
fr_ca: Au lieu de délivrer un permis individuel pour chaque modification apportée à une installation électrique, de gaz, mécanique ou de plomberie déjà approuvée, le fonctionnaire responsable du bâtiment est autorisé à délivrer un permis annuel, sur demande, à toute personne, entreprise ou société employant régulièrement une ou plusieurs personnes de métier qualifiées dans le bâtiment, la structure ou les lieux appartenant au demandeur du permis ou exploités par celui-ci.

source: Interconnection of carbon monoxide alarms in existing areas shall not be required where alterations or repairs do not result in removal of interior wall or ceiling finishes exposing the structure, unless there is an attic, crawl space or basement available that could provide access for interconnection without the removal of interior finishes.
fr_ca: L'interconnexion des détecteurs de monoxyde de carbone dans les zones existantes n'est pas exigée lorsque les modifications ou les réparations n'entraînent pas le retrait des revêtements intérieurs des murs ou des plafonds exposant la structure, à moins qu'il n'y ait un comble, un vide sanitaire ou un sous-sol disponible qui pourrait fournir un accès pour l'interconnexion sans le retrait des revêtements intérieurs.

source: Interior and exterior signs identifying permanent rooms and spaces shall comply with Sections 703.1, 703.2, and 703.3.
fr_ca: Les enseignes intérieures et extérieures identifiant les salles et les espaces permanents doivent être conformes aux sections 703.1, 703.2 et 703.3.

source: Interior corridors are protected by smoke detectors.
fr_ca: Les corridors intérieurs sont protégés par des détecteurs de fumée.

source: Interior exit stairway and ramp enclosures shall have a fire-resistance rating of not less than 2 hours where connecting four stories or more and not less than 1 hour where connecting less than four stories.
fr_ca: Les encloisonnements des escaliers et des rampes d’issue intérieurs doivent présenter un degré de résistance au feu d’au moins 2 heures lorsqu’ils relient quatre étages ou plus et d’au moins 1 heure lorsqu’ils relient moins de quatre étages.

source: Interior exit stairway and ramp opening protectives shall be in accordance with the requirements of Section 716.
fr_ca: La protection d'ouvertures des escaliers d’issue intérieurs et des rampes d’issue intérieures doivent être conformes aux exigences de la section 716.

source: Interior exit stairways and ramps serving as an exit component in a means of egress system shall comply with the requirements of this section.
fr_ca: Les escaliers et les rampes d'issue intérieurs servant de composant d'issue dans un moyen d'évacuation doivent être conformes aux exigences de la présente section.

source: Interior exit stairways and ramps shall be enclosed and lead directly to the exterior of the building or shall be extended to the exterior of the building with an exit passageway conforming to the requirements of Section 1024, except as permitted in Section 1028.2.
fr_ca: Les escaliers et les rampes d’issue intérieurs doivent être encloisonnés et mener directement à l’extérieur du bâtiment ou être prolongés jusqu’à l’extérieur du bâtiment par un passage d’issue conforme aux exigences de la section 1024, sauf dans les cas autorisés par la section 1028.2.

source: Interior exit stairways and ramps shall terminate at an exit discharge or a public way.
fr_ca: Les escaliers et les rampes d’issue intérieurs doivent aboutir à un niveau d’évacuation menant à l’extérieur ou à une voie publique.

source: Interior floor covering materials shall comply with Sections 804.4.1 and 804.4.2 and interior floor finish materials shall comply with Section 804.4.2.
fr_ca: Les matériaux de revêtement de plancher intérieur doivent être conformes aux sections 804.4.1 et 804.4.2 et les matériaux de revêtement de plancher intérieur doivent être conformes à la section 804.4.2.

source: Interior floor finish and floor covering materials required by Section 804.4.2 to be of Class I or II materials shall be classified in accordance with ASTM E648 or NFPA 253.
fr_ca: Les revêtements de sol intérieurs et les matériaux de revêtement de sol qui, conformément à la section 804.4.2, doivent être de classe I ou II doivent être classifiés conformément à la norme ASTM E648 ou à la norme NFPA 253.

source: Interior floor finish and floor covering materials shall be tested by an agency in accordance with ASTM E648 or NFPA 253 and identified by a hang tag or other suitable method so as to identify the manufacturer or supplier and style, and shall indicate the interior floor finish or floor covering classification in accordance with Section 804.2.
fr_ca: Les revêtements de sol intérieurs et les matériaux de revêtement de sol doivent être soumis à des essais par un organisme conformément à la norme ASTM E648 ou à la norme NFPA 253 et identifiés au moyen d’une étiquette volante ou d’une autre méthode appropriée permettant d’indiquer le fabricant ou le fournisseur ainsi que le modèle, et doivent indiquer la classification du revêtement de sol intérieur ou du matériau de revêtement de sol conformément à la section 804.2.

source: Interior floor finish and floor covering materials shall comply with Sections 804.2 through 804.4.2.
fr_ca: Les matériaux de finition de plancher intérieur et les revêtements de plancher doivent être conformes aux sections 804.2 à 804.4.2.

source: Interior floor-wall base that is 6 inches (152 mm) or less in height shall be tested in accordance with Section 804.2 and shall be not less than Class II. Where a Class I floor finish is required, the floor-wall base shall be Class I.
fr_ca: Le revêtement de base mur-plancher intérieur d’une hauteur d’au plus 6 pouces (152 mm) doit être soumis à des essais conformément à la section 804.2 et doit être au moins de classe II. Lorsqu’une finition de plancher de classe I est requise, le revêtement de base mur-plancher doit être de classe I.

source: Interior spaces intended for human occupancy shall be provided with active or passive space heating systems capable of maintaining an indoor temperature of not less than 68°F (20°C) at a point 3 feet (914 mm) above the floor on the design heating day.
fr_ca: Les espaces intérieurs destinés à être occupés par des personnes doivent être pourvus de systèmes de chauffage des locaux, actifs ou passifs, capables de maintenir une température intérieure d’au moins 68 °F (20 °C) en un point situé à 3 pi (914 mm) au-dessus du plancher, au cours de la journée de calcul du chauffage.

source: Interior spaces where the primary purpose of the space is not associated with human comfort.
fr_ca: Les aires intérieures dont l'usage principal n'est pas associé au confort humain.

source: Interior stairways shall be provided with an artificial light source to illuminate the landings and treads.
fr_ca: Les escaliers intérieurs doivent être dotés d'une source de lumière artificielle pour éclairer les paliers et les pas de marche.

source: Interior trim materials that comply with Section 806.7.
fr_ca: Matériaux d’éléments de finition intérieure conformes à la section 806.7.

source: Interlocking or scissor stairways shall be counted as one interior exit stairway.
fr_ca: Les escaliers imbriqués ou en ciseaux doivent être comptés comme un seul escalier d’issue intérieur.

source: Intermediate aisles shall be included in determining the total row length.
fr_ca: Les allées intermédiaires doivent être incluses dans la détermination de la longueur totale de la rangée.

source: Interpolation is permitted between the specific values shown.
fr_ca: L'interpolation est autorisée entre les valeurs spécifiques indiquées.

source: Interpolations shall be permitted for riser heights that are not listed in the table.
fr_ca: Les interpolations sont autorisées pour les hauteurs de contremarches qui ne sont pas indiquées dans le tableau.

source: Is not concealed within the construction of a wall or a floor/ceiling assembly.
fr_ca: N'est pas dissimulée dans la construction d'un mur ou d'un ensemble plancher-plafond.

source: Is not open to a corridor in Group I and R occupancies.
fr_ca: N'est pas ouverte sur un couloir dans les usages des groupes I et R.

source: Is not open to a corridor on non-sprinklered floors.
fr_ca: N'est pas ouverte sur un corridor sur des étages non équipés d'extincteurs.

source: Is separated from floor openings and air transfer openings serving other floors by construction conforming to required shaft enclosures.
fr_ca: Est séparé des ouvertures de plancher et des ouvertures permettant le passage de l'air desservant d'autres étages par une construction conforme aux puits encloisonnés requis.

source: Issuance of a certificate of occupancy shall not be construed as an approval of a violation of the provisions of this code or of other ordinances of the jurisdiction.
fr_ca: La délivrance d’un certificat d’occupation ne doit pas être interprétée comme une approbation d’une violation des dispositions du présent code ou d’autres règlements de la compétence territoriale.

source: It shall be the duty of the holder of the building permit or their duly authorized agent to notify the building official when work is ready for inspection.
fr_ca: Il incombe au titulaire du permis de construire ou à son mandataire dûment autorisé d’aviser le responsable de la construction lorsque les travaux sont prêts pour l’inspection.

source: It shall be the duty of the owner or the owner's authorized agent to cause the work to remain visible and able to be accessed for inspection purposes.
fr_ca: Il incombe au propriétaire ou à son mandataire autorisé de faire en sorte que les travaux restent visibles et accessibles à des fins d’inspection.

source: It shall be the duty of the permit holder to provide access to and means for inspections of such work that are required by this code.
fr_ca: Il incombe au titulaire du permis de fournir l’accès aux travaux visés par le présent code et les moyens nécessaires pour permettre les inspections exigées par celui-ci.

source: It shall be unlawful to place, or cause or permit to be placed, on any floor or roof of a building, structure or portion thereof, a load greater than is permitted by this code.
fr_ca: Il est interdit de placer, de faire placer ou de permettre que soient placées sur un plancher ou une toiture d’un bâtiment, d’une construction ou d’une partie de ceux-ci des charges supérieures à celles permises par le présent code.

source: It shall be unlawful to remove or deface such notices.
fr_ca: Il est interdit de retirer ou de dégrader ces avis.

source: Joints in or between floor assemblies without a required fire-resistance rating shall be permitted where they comply with one of the following:
fr_ca: Les joints dans ou entre les ensembles de plancher sans degré de résistance au feu requis sont autorisés lorsqu'ils sont conformes à l'une des conditions suivantes :

source: Joints made in or between horizontal assemblies shall comply with Section 715.
fr_ca: Les joints réalisés dans ou entre les ensembles horizontaux doivent être conformes à la section 715.

source: Joints made in or between smoke barriers shall comply with Section 715.
fr_ca: Les joints réalisés dans ou entre les séparations pare-fumée doivent être conformes à la section 715.

source: Joints meeting one of the exceptions specified in Section 715.3.
fr_ca: Joints répondant à l'une des exceptions spécifiées dans la section 715.3.

source: Joints shall be filled with an approved material to limit the free passage of smoke.
fr_ca: Les joints doivent être remplis d’un matériau approuvé afin de limiter le passage libre de la fumée.

source: Joints shall be permitted where complying with Section 712.1.5.1 or 712.1.5.2, as applicable.
fr_ca: Les joints sont autorisés lorsqu'ils sont conformes à la section 712.1.5.1 ou 712.1.5.2, selon ce qui s'applique.

source: Kitchen cabinets shall not be required to comply with Section 1102.14.
fr_ca: Les armoires de cuisine ne sont pas tenues de se conformer à la section 1102.14.

source: Kitchen cabinets shall not be required to comply with Section 1103.14.
fr_ca: Les armoires de cuisine ne sont pas tenues de se conformer à la section 1103.14.

source: Kitchen sinks, lavatories, bathtubs, showers, bidets, laundry tubs and washing machine outlets shall be provided with hot and cold water.
fr_ca: Les éviers de cuisine, les lavabos, les baignoires, les douches, les bidets, les cuves de lessive et les prises de laveuse doivent être alimentés en eau chaude et en eau froide.

source: Kitchens are not required to be of a minimum floor area.
fr_ca: Les cuisines ne sont pas tenues d'avoir une surface de plancher minimale.

source: Kitchens shall comply with Section 1103.12.
fr_ca: Les cuisines doivent être conformes à la section 1103.12.
